## **Importando as bibliotecas**

In [1]:
import pandas as pd
import numpy as np

## Documentação:

- [Documentação](https://pandas.pydata.org/pandas-docs/version/0.21/generated/pandas.DataFrame.html)
- [PDF de Pandas](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
- [Documentação do Método drop](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html).

## **Sumário:**

- **[Criando Series](#criando-series)**
  - [Criando DataFrame com Series](#criando-dataframe-com-serie)
  - [Reindexando Series](#reindexando-series)
  - [Ordenando Índices](#ordenando-índices)
  - [Ordenando Valores](#ordenando-valores)

- **[Criando Databases](#criando-databases)**
  - [DataFrame a partir de um array](#dataframe-a-partir-de-um-array)
  - [DataFrame a partir de um dicionário](#dataframe-a-partir-de-um-dicionário)
  - [Copiando DataFrame](#copiando-dataframe)
  - [Transpondo o DataFrame](#transpondo-o-dataframe)
  - [Visualizando Databases](#visualizando-databases)
    - [Visualizando uma Coluna](#visualizando-uma-coluna)
    - [Visualizando Valores de uma Coluna](#visualizando-valores-de-uma-coluna)
    - [Visualizando Repetição de Valores de uma Coluna](#visualizando-repetição-de-valores-de-uma-coluna)
    - [Visualizando Estatísticas](#visualizando-estatísticas)
    - [Operações Matemáticas](#operações-matemáticas)
    - [Visualizando Valores Nulos](#visualizando-valores-nulos)

- **[Adicionando Dados](#adicionando-dados)**
  - [Adicionando uma Nova Coluna](#adicionando-uma-nova-coluna)
  - [Adicionando uma Nova Linha](#adicionando-uma-nova-linha)
  - [Adicionando mais de uma Linha (Concatenando "Linhas")](#adicionando-mais-de-uma-linha-concatenando-linhas)
  - [Usando Reindex](#usando-reindex)
  - [Reindexando sem Perder os Dados](#reindexando-sem-perder-os-dados)
  - [Renomeando uma Coluna](#renomeando-uma-coluna)

- **[Excluindo Dados](#excluindo-dados)**
  - [Excluindo Colunas](#excluindo-colunas)
  - [Excluindo Linhas](#excluindo-linhas)
  - [Localizando e Deletando](#localizando-e-deletando)

- **[Consultando Dados](#consultando-dados)**
  - [Consultas por Índice](#consultas-por-índice)
  - [Consultas por Fatiamento](#consultas-por-fatiamento)
  - [Consulta com Critérios](#consulta-com-critérios)
  - [Consulta com mais de um Critério](#consulta-com-mais-de-um-critério)

- **[Consulta por Query](#consulta-por-query)**
  - [Consulta por Query com mais de um Critério](#consulta-por-query-com-mais-de-um-critério)

- **[Lambda](#lambda)**
  - [Operações de Filtragem](#operações-de-filtragem)
  - [Adicionando Coluna de Utilidade](#adicionando-coluna-de-utilidade)
  - [Lambda de Formatação](#lambda-de-formatação)
  - [Lambda Conversão](#lambda-conversão)
  
- **[Média, Mediana, Moda](#média-mediana-moda)**

## **Criando Series**

In [2]:
obj = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [3]:
obj2 = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj2

d    0
a    1
b    2
c    3
dtype: int64

#### Criando dataframa com serie

In [4]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), 
                        index=['a','c','d'], 
                        columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

#### Reidexando Series

In [5]:
obj.reindex(range(10))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
6       NaN
7       NaN
8       NaN
9       NaN
dtype: object

In [6]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [7]:
frame3 = frame.reindex(columns=['Ohio','Texas','Miame','California'])
frame3

   Ohio  Texas  Miame  California
a     0      1    NaN           2
c     3      4    NaN           5
d     6      7    NaN           8

#### Sortando Indices

In [8]:
obj.sort_index()

0      blue
2    purple
4    yellow
dtype: object

In [9]:
fr = pd.DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
fr

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [10]:
fr.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [11]:
fr.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [12]:
fr.sort_index(axis='columns', ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

#### Sortando Valores

In [13]:
fr = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
fr

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [14]:
fr.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [15]:
fr.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

## **Criando Databases**

index são "Linhas" e columns sao "Colunas"

#### Criando um DataFrame a partir de um array

In [16]:
array1 = np.array([[0,1,2],[3,4,5]])
dataframe1 = pd.DataFrame(array1, columns=['col1','col2','col3'])

# Exibindo o DataFrame

dataframe1

   col1  col2  col3
0     0     1     2
1     3     4     5

#### Criando um DataFrame a partir de um dicionário

In [17]:
pop_data = {'Flamengo': [56,72,90,71, 71],
        'Palmeiras': [63, 80,74,58,66],
        'Corinthians': [72, 44,56,51,57]}

futebol = pd.DataFrame(pop_data, index=[2017,2018,2019,2020,2021])
futebol

      Flamengo  Palmeiras  Corinthians
2017        56         63           72
2018        72         80           44
2019        90         74           56
2020        71         58           51
2021        71         66           57

#### Copiando Dataframe

In [18]:
futebol2 = futebol.copy()
futebol2

      Flamengo  Palmeiras  Corinthians
2017        56         63           72
2018        72         80           44
2019        90         74           56
2020        71         58           51
2021        71         66           57

#### Copiando colunas especificas

In [19]:

futt = futebol[['Flamengo', 'Palmeiras']].copy()
futt

      Flamengo  Palmeiras
2017        56         63
2018        72         80
2019        90         74
2020        71         58
2021        71         66

#### Transpondo o DataFrame

In [20]:
futebolT = futebol.T
futebolT

             2017  2018  2019  2020  2021
Flamengo       56    72    90    71    71
Palmeiras      63    80    74    58    66
Corinthians    72    44    56    51    57

### **Visualizando Databases**

#### Visualizando uma coluna

In [21]:
futebol['Flamengo']

2017    56
2018    72
2019    90
2020    71
2021    71
Name: Flamengo, dtype: int64

#### Visualizando valores de uma coluna

In [22]:
futebol['Flamengo'].values

array([56, 72, 90, 71, 71], dtype=int64)

#### Visualizando repetição de valores de uma coluna

In [23]:
futebol['Flamengo'].value_counts()

Flamengo
71    2
56    1
72    1
90    1
Name: count, dtype: int64

#### Visualizando estatísticas

In [24]:
futebol.describe()

        Flamengo  Palmeiras  Corinthians
count   5.000000   5.000000     5.000000
mean   72.000000  68.200000    56.000000
std    12.062338   8.786353    10.319884
min    56.000000  58.000000    44.000000
25%    71.000000  63.000000    51.000000
50%    71.000000  66.000000    56.000000
75%    72.000000  74.000000    57.000000
max    90.000000  80.000000    72.000000

#### Operações matemáticas

In [25]:
futebol.sum()

Flamengo       360
Palmeiras      341
Corinthians    280
dtype: int64

In [26]:
futebol.sum(axis='columns')

2017    191
2018    196
2019    220
2020    180
2021    194
dtype: int64

In [27]:
futebol.mean()

Flamengo       72.0
Palmeiras      68.2
Corinthians    56.0
dtype: float64

In [28]:
futebol.median()

Flamengo       71.0
Palmeiras      66.0
Corinthians    56.0
dtype: float64

In [29]:
futebol.min()

Flamengo       56
Palmeiras      58
Corinthians    44
dtype: int64

In [30]:
futebol.max()

Flamengo       90
Palmeiras      80
Corinthians    72
dtype: int64

#### Visualizando valores nulos

In [31]:
futebol.isnull()

      Flamengo  Palmeiras  Corinthians
2017     False      False        False
2018     False      False        False
2019     False      False        False
2020     False      False        False
2021     False      False        False

#### Visualizando Incio e Fim

In [32]:
futebol.head() #Padrao mostra 5 primeiras linhas

      Flamengo  Palmeiras  Corinthians
2017        56         63           72
2018        72         80           44
2019        90         74           56
2020        71         58           51
2021        71         66           57

In [33]:
# Comando para visualizarmos as 5 últimas linhas do Dataset.
futebol.tail()

      Flamengo  Palmeiras  Corinthians
2017        56         63           72
2018        72         80           44
2019        90         74           56
2020        71         58           51
2021        71         66           57

#### Cálculo do percentual de dados faltantes no Dataset.

In [34]:
#shape(0)-todas as linhas
(futebol.isnull().sum() / futebol.shape[0]).sort_values(ascending=False)

Flamengo       0.0
Palmeiras      0.0
Corinthians    0.0
dtype: float64

### **Adcionando Dados**

#### Adicionando uma nova Colunas

In [35]:
futebol['nova'] = np.NaN
futebol

      Flamengo  Palmeiras  Corinthians  nova
2017        56         63           72   NaN
2018        72         80           44   NaN
2019        90         74           56   NaN
2020        71         58           51   NaN
2021        71         66           57   NaN

In [36]:
futebol['Flamengo2'] = futebol['Flamengo']*2
futebol

      Flamengo  Palmeiras  Corinthians  nova  Flamengo2
2017        56         63           72   NaN        112
2018        72         80           44   NaN        144
2019        90         74           56   NaN        180
2020        71         58           51   NaN        142
2021        71         66           57   NaN        142

#### Adicionando uma nova Linhas

In [37]:
futebol.loc[len(futebol.index)] = [0, 0, 0, 0, 0]
futebol

      Flamengo  Palmeiras  Corinthians  nova  Flamengo2
2017        56         63           72   NaN        112
2018        72         80           44   NaN        144
2019        90         74           56   NaN        180
2020        71         58           51   NaN        142
2021        71         66           57   NaN        142
5            0          0            0   0.0          0

#### Adcionando mais de uma linha (Concatenando "Linhas")

In [38]:
# Isso faz com que o index resete

fut = {'Flamengo': [0,0],
        'Palmeiras': [0,'Deletar'],
        'Corinthians': [0,0],
        'nova': [0,0],
        'Flamengo2':[0,0]
       }
  
fut2 = pd.DataFrame(fut) 
  
futebol = pd.concat([futebol, fut2], ignore_index = True)
futebol

   Flamengo Palmeiras  Corinthians  nova  Flamengo2
0        56        63           72   NaN        112
1        72        80           44   NaN        144
2        90        74           56   NaN        180
3        71        58           51   NaN        142
4        71        66           57   NaN        142
5         0         0            0   0.0          0
6         0         0            0   0.0          0
7         0   Deletar            0   0.0          0

#### Usando Reidex

In [39]:
futebol3 = futebol.copy()
futebol3 = futebol3.reindex([2017, 2018, 2019, 2020, 2021, 5, 6, 7])
futebol3

      Flamengo Palmeiras  Corinthians  nova  Flamengo2
2017       NaN       NaN          NaN   NaN        NaN
2018       NaN       NaN          NaN   NaN        NaN
2019       NaN       NaN          NaN   NaN        NaN
2020       NaN       NaN          NaN   NaN        NaN
2021       NaN       NaN          NaN   NaN        NaN
5          0.0         0          0.0   0.0        0.0
6          0.0         0          0.0   0.0        0.0
7          0.0   Deletar          0.0   0.0        0.0

#### Reindexando sem perder os dados

In [40]:
futebol['Data'] = [2017,2018,2019,2020,2021,5,6,7] #Criei uma coluna 'Data' para poder usar o set_index

'''
df.set_index('xcol') makes the column 'xcol' 
become the index (when it is a column of df).

df.reindex(myList), however, takes indexes from outside the dataframe, 
for example, from a list named myList that we defined somewhere else.
'''

futebol = futebol.set_index(['Data'])
futebol

      Flamengo Palmeiras  Corinthians  nova  Flamengo2
Data
2017        56        63           72   NaN        112
2018        72        80           44   NaN        144
2019        90        74           56   NaN        180
2020        71        58           51   NaN        142
2021        71        66           57   NaN        142
5            0         0            0   0.0          0
6            0         0            0   0.0          0
7            0   Deletar            0   0.0          0

#### Renomeando uma coluna

In [41]:
futebol.rename(columns={'nova':'CAM'}) #Só visualização

      Flamengo Palmeiras  Corinthians  CAM  Flamengo2
Data
2017        56        63           72  NaN        112
2018        72        80           44  NaN        144
2019        90        74           56  NaN        180
2020        71        58           51  NaN        142
2021        71        66           57  NaN        142
5            0         0            0  0.0          0
6            0         0            0  0.0          0
7            0   Deletar            0  0.0          0

In [42]:
futebol = futebol.rename(columns={'nova':'CAM'})
futebol

      Flamengo Palmeiras  Corinthians  CAM  Flamengo2
Data
2017        56        63           72  NaN        112
2018        72        80           44  NaN        144
2019        90        74           56  NaN        180
2020        71        58           51  NaN        142
2021        71        66           57  NaN        142
5            0         0            0  0.0          0
6            0         0            0  0.0          0
7            0   Deletar            0  0.0          0

In [43]:
futebol.rename(columns={'CAM':'Atletico'}, inplace=True)
futebol

      Flamengo Palmeiras  Corinthians  Atletico  Flamengo2
Data
2017        56        63           72       NaN        112
2018        72        80           44       NaN        144
2019        90        74           56       NaN        180
2020        71        58           51       NaN        142
2021        71        66           57       NaN        142
5            0         0            0       0.0          0
6            0         0            0       0.0          0
7            0   Deletar            0       0.0          0

### **Excluindo Dados**

#### Excluindo Colunas

In [44]:
futebol.drop(['Atletico','Flamengo2'], axis='columns') #Só visualização
futebol

      Flamengo Palmeiras  Corinthians  Atletico  Flamengo2
Data
2017        56        63           72       NaN        112
2018        72        80           44       NaN        144
2019        90        74           56       NaN        180
2020        71        58           51       NaN        142
2021        71        66           57       NaN        142
5            0         0            0       0.0          0
6            0         0            0       0.0          0
7            0   Deletar            0       0.0          0

In [45]:
futebol.drop(['Atletico'], inplace=True, axis='columns')
futebol

      Flamengo Palmeiras  Corinthians  Flamengo2
Data
2017        56        63           72        112
2018        72        80           44        144
2019        90        74           56        180
2020        71        58           51        142
2021        71        66           57        142
5            0         0            0          0
6            0         0            0          0
7            0   Deletar            0          0

In [46]:
del futebol['Flamengo2']
futebol

      Flamengo Palmeiras  Corinthians
Data
2017        56        63           72
2018        72        80           44
2019        90        74           56
2020        71        58           51
2021        71        66           57
5            0         0            0
6            0         0            0
7            0   Deletar            0

#### Excluindo Linhas

In [47]:
futebol.drop(5) #Só visualização

      Flamengo Palmeiras  Corinthians
Data
2017        56        63           72
2018        72        80           44
2019        90        74           56
2020        71        58           51
2021        71        66           57
6            0         0            0
7            0   Deletar            0

In [48]:
futebol.drop([5,6], inplace= True)
futebol

      Flamengo Palmeiras  Corinthians
Data
2017        56        63           72
2018        72        80           44
2019        90        74           56
2020        71        58           51
2021        71        66           57
7            0   Deletar            0

#### Localizando e deletando

In [49]:
i = futebol.loc[(futebol['Palmeiras'] == "Deletar")]
futebol.drop(i.index, inplace=True) # O .index informa que voce quer a linha, nao a coluna.
futebol

      Flamengo Palmeiras  Corinthians
Data
2017        56        63           72
2018        72        80           44
2019        90        74           56
2020        71        58           51
2021        71        66           57

### **Consultando Dados**

#### Consultas por Indice

In [50]:
futebol.loc[2017] # Seria o indice 0

Flamengo       56
Palmeiras      63
Corinthians    72
Name: 2017, dtype: object

In [51]:
futebol.loc[2017]['Flamengo']

56

In [52]:
futebol.loc[[2017,2019,2021]]

      Flamengo Palmeiras  Corinthians
Data
2017        56        63           72
2019        90        74           56
2021        71        66           57

In [53]:
futebol.iloc[0,2] # Loc pega o indice da linha, o ILOC pega linha e a coluna [linha ,coluna]

72

#### Consultas por Fatiamento

In [54]:
futebol[0:2]

      Flamengo Palmeiras  Corinthians
Data
2017        56        63           72
2018        72        80           44

In [55]:
futebol[:1]['Flamengo']

Data
2017    56
Name: Flamengo, dtype: int64

#### Consulta com criterios

In [56]:
futebol.loc[futebol['Flamengo'] < 80]

      Flamengo Palmeiras  Corinthians
Data
2017        56        63           72
2018        72        80           44
2020        71        58           51
2021        71        66           57

In [57]:
futebol.loc[futebol['Flamengo'] == 71]

      Flamengo Palmeiras  Corinthians
Data
2020        71        58           51
2021        71        66           57

#### Consulta com mais de um criterio

In [58]:
futebol.loc[(futebol['Flamengo'] < 80) & (futebol['Corinthians'] == 72)]

      Flamengo Palmeiras  Corinthians
Data
2017        56        63           72

### **Consulta por Query**

In [59]:
futebol.query('Flamengo == 71')

      Flamengo Palmeiras  Corinthians
Data
2020        71        58           51
2021        71        66           57

#### Consulta por Query com mais de um criterio

In [60]:
futebol.query('60 <= Flamengo < 80') #Imagina que isso diz, "Está entre", para facilitar

      Flamengo Palmeiras  Corinthians
Data
2018        72        80           44
2020        71        58           51
2021        71        66           57

## **Lambda**

As expressões lambda em Python são funções anônimas úteis para operações rápidas e simples. Abaixo está um exemplo de uma expressão lambda que calcula o imposto sobre um preço:

Semelhante as funções do python.

In [61]:
preco = 1000
def calcular_imposto(preco):
  return preco*0.3
print(calcular_imposto(preco))

300.0

In [62]:
calcular_imposto2 = lambda x: x*0.3
calcular_imposto2(preco)

300.0

### Operações de filtragem

In [63]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [64]:
f = lambda x: x.max() - x.min()
frame.apply(f)

Ohio          6
Texas         6
California    6
dtype: int32

In [65]:
frame.apply(f, axis='columns')

a    2
c    2
d    2
dtype: int32

#### Adcionando coluna de Utilidade

In [66]:
frame['total'] = frame.apply(lambda x: x.sum(), axis='columns')
frame

   Ohio  Texas  California  total
a     0      1           2      3
c     3      4           5     12
d     6      7           8     21

In [67]:
frame['category'] = frame['total'].apply(lambda x: 'impar' if x%2 else 'par')
frame

   Ohio  Texas  California  total category
a     0      1           2      3    impar
c     3      4           5     12      par
d     6      7           8     21    impar

In [68]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f)

     Ohio  Texas  California  total category
min     0      1           2      3    impar
max     6      7           8     21      par

### Lambda de Formatação

In [69]:
numbers = pd.DataFrame(np.random.randn(4,3), columns=list('abc'), index=['c1', 'c2', 'c3', 'c4'])
numbers

           a         b         c
c1 -0.896783 -1.058352 -0.672222
c2 -1.035399 -0.386747 -0.188761
c3  0.311382  0.616056  0.080985
c4 -0.316748  0.248373 -1.648335

In [70]:
format = lambda x: '%.2f' % x # %x (aplica no x)
numbers.applymap(format) #applymap aplica em tudo, apply aplica so em lugares selecionados

C:\Users\Cassio\AppData\Local\Temp\ipykernel_1348\1275615423.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  numbers.applymap(format) #applymap aplica em tudo, apply aplica so em lugares selecionados

        a      b      c
c1  -0.90  -1.06  -0.67
c2  -1.04  -0.39  -0.19
c3   0.31   0.62   0.08
c4  -0.32   0.25  -1.65

In [71]:
# pip install jinja2
def color_df(val):
  color = 'red' if val < 0 else 'blue'
  return 'color: ' + color

numbers.style.applymap(color_df)

C:\Users\Cassio\AppData\Local\Temp\ipykernel_1348\2435326910.py:6: FutureWarning: Styler.applymap has been deprecated. Use Styler.map instead.
  numbers.style.applymap(color_df)

### Lambda Conversão

In [72]:
a = pd.Series(range(10))
a

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [73]:
a = a.astype(float)
a

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

### Media Mediana Moda

In [74]:
exemplo =  pd.Series([1,5,10,30,30, 40, 500])

In [75]:
print(exemplo.mean())
print(exemplo.median())
print(exemplo.mode())

88.0
30.0
0    30
dtype: int64